Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3602.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <version>02674</version>
         <description>Watch Dog Timer</description>
         <baseAddress>0x44000500</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>WDTCON</name>
               <description>Watchdog Timer Control Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>WDTWINEN</name>
                     <description>Watchdog Timer Window Enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WDTWINENSelect</name>
                        <enumeratedValue>
                           <name>WDTWINEN</name>
                           <description>Enable windowed Watchdog Timer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDTWINDIS</name>
                           <description>Disable windowed Watchdog Timer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLPDIV</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CLKSEL</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RUNDIV</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Watchdog Timer Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>WDTEN</name>
                           <description>The WDT module is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDTOFF</name>
                           <description>The WDT module is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTCLRKEY</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCONCLR</name>
               <addressOffset>0x04</addressOffset>
            </register>
            <register>
               <name>WDTCONSET</name>
               <addressOffset>0x08</addressOffset>
            </register>
            <register>
               <name>WDTCONINV</name>
               <addressOffset>0x0C</addressOffset>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
